{
  "_name_or_path": "DeepPavlov/rubert-base-cased",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "atm",
    "1": "\u0438\u043f\u0442/\u0431\u043f\u0442/\u043f\u0442\u0431\u0441\u043a",
    "2": "\u043a\u0430\u0440\u0442\u0430",
    "3": "\u0441\u043c\u0441",
    "4": "\u043f/\u043a",
    "5": "\u043c\u043e\u0431\u0438\u043b\u044c\u043d\u043e\u0435 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u0435",
    "6": "\u0432\u043a\u043b\u0430\u0434\u044b",
    "7": "pos",
    "8": "\u0438\u043d\u0442\u0435\u0440\u043d\u0435\u0442 \u0431\u0430\u043d\u043a",
    "9": "\u0441\u0435\u0440\u0432\u0438\u0441",
    "10": "\u043a\u0430\u0441\u0441\u0430",
    "11": "\u0440\u043a\u043e \u044e\u043b",
    "12": "\u043a\u0440\u0435\u0434\u0438\u0442\u043e\u0432\u0430\u043d\u0438\u0435 \u0444\u043b",
    "13": "\u0440\u043a\u043e \u0444\u043b",
    "14": "\u043f\u0435\u0440\u0435\u0432\u043e\u0434\u044b"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "atm": 0,
    "pos": 7,
    "\u0432\u043a\u043b\u0430\u0434\u044b": 6,
    "\u0438\u043d\u0442\u0435\u0440\u043d\u0435\u0442 \u0431\u0430\u043d\u043a": 8,
    "\u0438\u043f\u0442/\u0431\u043f\u0442/\u043f\u0442\u0431\u0441\u043a": 1,
    "\u043a\u0430\u0440\u0442\u0430": 2,
    "\u043a\u0430\u0441\u0441\u0430": 10,
    "\u043a\u0440\u0435\u0434\u0438\u0442\u043e\u0432\u0430\u043d\u0438\u0435 \u0444\u043b": 12,
    "\u043c\u043e\u0431\u0438\u043b\u044c\u043d\u043e\u0435 \u043f\u0440\u0438\u043b\u043e\u0436\u0435\u043d\u0438\u0435": 5,
    "\u043f/\u043a": 4,
    "\u043f\u0435\u0440\u0435\u0432\u043e\u0434\u044b": 14,
    "\u0440\u043a\u043e \u0444\u043b": 13,
    "\u0440\u043a\u043e \u044e\u043b": 11,
    "\u0441\u0435\u0440\u0432\u0438\u0441": 9,
    "\u0441\u043c\u0441": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.31.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
